 console.log('number' + 3 + 3); // виведе number33 тому що string+number+number без пробелів- конкатенація строки
 console.log(null + 3); //виведе 3, тому що null-це 0,0+3=3
 console.log(5 && "qwerty"); //виведе qwerty, якщо у нас все true і немає false, тож зі &&  вираз буде виконуватися до останього значення і повертати тільке останне значення
 console.log(+'40' + +'2' + "hillel"); /* 42hillel- унарний + перетворює тип даних на число (унарний - на число з протилежним знаком), тобто  стринга "40" стає числом, теж і з "2", вираз виглядає так: 40+2+"hillel", 40+2- виведе результат і без пробілів hillel. Чесно кажучи не зразу зрозуміла, що це унарний +, трохи підглянула, зато створила пам'ятку:
 +true-1; +false-0; +null-0; +undefined-NaN; '123'-123; 'abc'-NaN; []-0: {}-NaN. */
console.log('10' - 5 === 6); //false, завжди в математичному виразі приводить стрингу до числа( в додаванні число до стринги), якщо можна, у нас виходить 10-5=5, 5===(строге дорівняння)6- це false
console.log(true + false); //1, тому що true=1, false=0, загалом 1+0=1
console.log('4px' - 3); //NaN,  4px- це не число, від не числа відняти 3 дорівнює... немає такого числа, тож математична дія з нечислом (або що не можна привести до числа) завжди NaN
console.log('4' - 3); // 1, '4'-'3'=4-3=1
console.log('6' + 3 ** 0); //61; підглянула, бо забула математичні формули з возведенням у ступень. Тож 3**0=1- це виконуємо першим, далі "6" + 1- при додаванні строки з числом завжди число преобразується в строку!!!! тож строкова конкотенація!!! "6"+"1"= 61
console.log(12 / '6'); // 2, вроде ніяких спеціальних правил немає, тож все просто 12:6=2
console.log('10' + (5 === 6));//10false, '10'-це стринга, тобто виводить 10, вираз (5===6)- це false, при додаванні стринги з булевим значенням виведе стрингу з цим булевим значенням, тобто все преобразує в одну стрингу.
console.log(null == ''); //false, тому що це виняток, коли нестроге рівняння, то null==underfined і це true, тобто тут true==0 -> false. Null and underfined не перетворюються у число при нестрогому рівнянні!!!!!!!!!
console.log(3 ** (9 / 3))//27, перше виконуємо дію в дужках 9/3=3, возводим у ступень 3**3=27- це прості аріфметичні дії
console.log(!!'false' == !!'true')// true, тут 'false' та 'true'- це рядки, щоб там внутрі не було записано, !!- оператор, перетворюємо на булеве значення, !!"рядок"=true, тож у нас true=true і це-true
console.log(0 || '0' && 1)// 1, останне значення 1, попереду все true (зі &&  вираз буде виконуватися до останього значення і повертати тільке останне значення)
console.log((+null == false) < 1)//false, +null=0, false=0; 0==0- true, true -це 1, тож 1<1 - false
console.log(false && true || true)// думала, що false, а правильно true. У нас перше false і не повинно дальше йти. Але... приоритет && перед ||, перше виконуємо false && true- буде false, тому що на false зупиняється і далі не йде, друге виконуємо false || true- повертає true завжди
console.log(false && (false || true))//false, головна дія одна - && і що у дужках вже неважливо. перше false, далі дія не йде.
console.log((+null == false) < 1 ** 5)//false, +null=0 false=0, (0==0)<1**5, 1**5=1, true<1, 1<1,а це false




